; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	image0 - mode
	Star1 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star7 - direction
	Star9 - direction
	GroundStation8 - direction
	Star6 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 image0)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star7)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation8)
	(supports instrument5 image1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Star10 image0)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image0)
	(have_image Planet13 image0)
	(have_image Phenomenon14 image0)
	(have_image Planet15 image0)
	(have_image Planet16 image1)
	(have_image Star17 image1)
	(have_image Planet18 image0)
	(have_image Star19 image1)
))

)

; plan
1. (turn_to satellite1 star7 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star7)
   goals met: 1 of 11
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 11
3. (calibrate satellite1 instrument3 star7)
   added: (calibrated instrument3)
   goals met: 1 of 11
4. (turn_to satellite1 phenomenon14 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 11
5. (take_image satellite1 phenomenon14 instrument3 image0)
   added: (have_image phenomenon14 image0)
   goals met: 2 of 11
6. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 11
7. (take_image satellite1 phenomenon12 instrument3 image0)
   added: (have_image phenomenon12 image0)
   goals met: 3 of 11
8. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 11
9. (take_image satellite1 phenomenon11 instrument3 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 11
10. (turn_to satellite1 planet13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet13)
   goals met: 4 of 11
11. (take_image satellite1 planet13 instrument3 image0)
   added: (have_image planet13 image0)
   goals met: 5 of 11
12. (turn_to satellite1 planet15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet15)
   goals met: 5 of 11
13. (take_image satellite1 planet15 instrument3 image0)
   added: (have_image planet15 image0)
   goals met: 6 of 11
14. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 6 of 11
15. (take_image satellite1 planet16 instrument3 image1)
   added: (have_image planet16 image1)
   goals met: 7 of 11
16. (turn_to satellite1 planet18 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet18)
   goals met: 7 of 11
17. (take_image satellite1 planet18 instrument3 image0)
   added: (have_image planet18 image0)
   goals met: 8 of 11
18. (turn_to satellite1 star10 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star10)
   goals met: 8 of 11
19. (take_image satellite1 star10 instrument3 image0)
   added: (have_image star10 image0)
   goals met: 9 of 11
20. (turn_to satellite1 star17 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star17)
   goals met: 9 of 11
21. (take_image satellite1 star17 instrument3 image1)
   added: (have_image star17 image1)
   goals met: 10 of 11
22. (turn_to satellite1 star19 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star19)
   goals met: 10 of 11
23. (take_image satellite1 star19 instrument3 image1)
   added: (have_image star19 image1)
   goals met: 11 of 11
